### SIMPLE RANDOM SAMPLING

In [20]:
import pandas as pd
df=pd.read_csv('C:\\Users\\jhasa\\Desktop\\startup_funding.csv',encoding="utf8")
amount=df['AmountInUSD']

In [21]:
amount.dropna(inplace=True)
amount.reset_index(drop=True,inplace=True)
amount.head()

0    1,300,000
1      500,000
2      850,000
3    1,000,000
4    2,600,000
Name: AmountInUSD, dtype: object

In [23]:
amount=amount.str.replace(',','')
amount.head()

0    1300000
1     500000
2     850000
3    1000000
4    2600000
Name: AmountInUSD, dtype: object

In [25]:
amount=pd.to_numeric(amount)

In [26]:
amount.head()

0    1300000
1     500000
2     850000
3    1000000
4    2600000
Name: AmountInUSD, dtype: int64

In [46]:
population=amount
sample_size=100
sample=population.sample(sample_size,random_state=1)# this will select a record and will ensure that the same record is not
                                                    # selected again

In [47]:
print(population.mean()," ",sample.mean())
print(population.max()," ",sample.max())
print(population.min()," ",sample.min())

12031073.099016393   24592930.0
1400000000   1400000000
16000   18000

### PROBLEM - AVERAGE FUNDING

In [114]:
import pandas as pd
df=pd.read_csv('C:\\Users\\jhasa\\Desktop\\startup_funding.csv',encoding="utf8")
df1=df.loc[:,["CityLocation","AmountInUSD"]]
df1.head()

  CityLocation AmountInUSD
0    Bangalore   1,300,000
1       Mumbai         NaN
2    New Delhi         NaN
3       Mumbai     500,000
4    Hyderabad     850,000

In [115]:
df1.CityLocation.replace("Delhi","New Delhi",inplace =True)
df1.CityLocation.replace("bangalore","Bangalore",inplace =True)

In [116]:
df1.AmountInUSD.replace(",","",inplace=True,regex=True)
df1.head()

  CityLocation AmountInUSD
0    Bangalore     1300000
1       Mumbai         NaN
2    New Delhi         NaN
3       Mumbai      500000
4    Hyderabad      850000

In [117]:
df1.AmountInUSD=pd.to_numeric(df1.AmountInUSD)

In [118]:
df1.AmountInUSD.fillna(df1.AmountInUSD.mean(),inplace=True)

In [119]:
population=df1.AmountInUSD

In [124]:
sample_size=50
sample=population.sample(sample_size,random_state=1)
print(population.mean(),sample.mean(),population.mean()-sample.mean())
s1=population.mean()-sample.mean()

12031073.099016525 9503804.85366557 2527268.245350955

In [125]:
sample_size=50
sample=population.sample(sample_size,random_state=0)
print(population.mean(),sample.mean(),population.mean()-sample.mean())
s0=population.mean()-sample.mean()

12031073.099016525 5473564.853665574 6557508.24535095

In [126]:
print(s1-s0)

-4030239.9999999953

### PROBLEM - STRATIFIED SAMPLING

In [63]:
import pandas as pd
df=pd.read_csv('C:\\Users\\jhasa\\Desktop\\startup_funding.csv',encoding="utf8")
df1=df.loc[:,["CityLocation","AmountInUSD"]]
df1.head()

  CityLocation AmountInUSD
0    Bangalore   1,300,000
1       Mumbai         NaN
2    New Delhi         NaN
3       Mumbai     500,000
4    Hyderabad     850,000

In [64]:
df1.CityLocation.replace("Delhi","New Delhi",inplace =True,regex=False)
df1.CityLocation.replace("bangalore","Bangalore",inplace =True,regex=False)

In [65]:
df1.AmountInUSD.replace(",","",inplace=True,regex=True)
df1.AmountInUSD=pd.to_numeric(df1.AmountInUSD)
df1.AmountInUSD.fillna(df1.AmountInUSD.mean(),inplace=True)
df1.head()

  CityLocation   AmountInUSD
0    Bangalore  1.300000e+06
1       Mumbai  1.203107e+07
2    New Delhi  1.203107e+07
3       Mumbai  5.000000e+05
4    Hyderabad  8.500000e+05

In [66]:
df2=df1[df1.CityLocation=='Bangalore']
df3=df1[df1.CityLocation=='New Delhi']
df4=df1[df1.CityLocation=='Gurgaon']
df5=df1[df1.CityLocation=='Noida']
df6=df1[df1.CityLocation=='Mumbai']
df7=df1[df1.CityLocation=='Pune']
df8=df1[df1.CityLocation=='Hyderabad']

In [67]:
population=df1
parameter=population.mean()

In [68]:
sample_size=20
n2=df2.AmountInUSD.sample(sample_size,random_state=1).values
n3=df3.AmountInUSD.sample(sample_size,random_state=1).values
n4=df4.AmountInUSD.sample(sample_size,random_state=1).values
n5=df5.AmountInUSD.sample(sample_size,random_state=1).values
n6=df6.AmountInUSD.sample(sample_size,random_state=1).values
n7=df7.AmountInUSD.sample(sample_size,random_state=1).values
n8=df8.AmountInUSD.sample(sample_size,random_state=1).values

In [69]:
x=n2.sum()+n3.sum()+n4.sum()+n5.sum()+n6.sum()+n7.sum()+n8.sum()
statistics=x/100

In [71]:
print(parameter-statistics)

AmountInUSD    918786.549508
dtype: float64

### PROPORTIONAL STRATIFIED SAMPLING

In [81]:
import pandas as pd
df=pd.read_csv('C:\\Users\\jhasa\\Desktop\\startup_funding.csv',encoding="utf8")
df1=df.loc[:,["CityLocation","AmountInUSD"]]
df1.head()

  CityLocation AmountInUSD
0    Bangalore   1,300,000
1       Mumbai         NaN
2    New Delhi         NaN
3       Mumbai     500,000
4    Hyderabad     850,000

In [82]:
df1.CityLocation.replace("Delhi","New Delhi",inplace =True,regex=False)
df1.CityLocation.replace("bangalore","Bangalore",inplace =True,regex=False)
df1.AmountInUSD.replace(",","",inplace=True,regex=True)
df1.AmountInUSD=pd.to_numeric(df1.AmountInUSD)
df1.AmountInUSD.fillna(df1.AmountInUSD.mean(),inplace=True)

In [83]:
df2=df1[df1.CityLocation=='Bangalore']
df3=df1[df1.CityLocation=='New Delhi']
df4=df1[df1.CityLocation=='Gurgaon']
df5=df1[df1.CityLocation=='Noida']
df6=df1[df1.CityLocation=='Mumbai']
df7=df1[df1.CityLocation=='Pune']
df8=df1[df1.CityLocation=='Hyderabad']

In [88]:
s2=((df2.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
s3=((df3.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
s4=((df4.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
s5=((df5.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
s6=((df6.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
s7=((df7.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
s8=((df8.AmountInUSD.count())*100//(df1.AmountInUSD.count()))
population=df1
parameter=population.mean()

In [89]:
n2=df2.AmountInUSD.sample(s2,random_state=1).values
n3=df3.AmountInUSD.sample(s3,random_state=1).values
n4=df4.AmountInUSD.sample(s4,random_state=1).values
n5=df5.AmountInUSD.sample(s5,random_state=1).values
n6=df6.AmountInUSD.sample(s6,random_state=1).values
n7=df7.AmountInUSD.sample(s7,random_state=1).values
n8=df8.AmountInUSD.sample(s8,random_state=1).values

In [92]:
x=n2.sum()+n3.sum()+n4.sum()+n5.sum()+n6.sum()+n7.sum()+n8.sum()
statistics=x/100

In [93]:
print(parameter-statistics)

AmountInUSD    4.839112e+06
dtype: float64